{"data":{"site":{"siteMetadata":{"title":"positiveneutron.github.io"}},"markdownRemark":{"html":"<p>Tiba saatnya yang dinantikan*halah lebay bahasanya. Setelah sebelumnya belajar redux thunk si middlewarenya react redux,\nhari ini di kantor dimana gue jemput rezeki, ngasih template react yang dibeli dari salah satu web penjualan template.\nNgerasa belum pede awalnya karena baru pertama bongkar template yang berbayar, notabene nya pasti well documented.\nBener aja tuh template organized baik dari struktur folder projek koding sampai desainnya.\nSeneng bgt sih sebenernya ma karena ngebantu banget kalau projek well documented tuh.</p>\n<p>\n    <span color='red'>Ini sih point belajarnya ma!</span> Meskipun gue ngerasa bahwa udah nguasain struktur folder projek\n    react redux thunk pada umumnya, still kudu wajib baca dokumentasi nya entirely loh!. Soalnya template react yang\n    di kantor hari ini dikasih, banyak banget folder yang kudu diminimalisir buat di edit. Karena kudu diperhatiin ketika\n    akan kustomisasi dan saran pribadi, kudu dibackup folder skeleton dari projek tempate tsb. \n</p>\n<p>\nMerenung, mikir sejenak, langsung buka Medium cari tahu apa itu Redux Thunk. \nSeru sih pembahasannya tapi agak overwhelmed karena dari beberapa artikel fokus selain bahas konsep dan ngebandingin sama middleware lainnya.\nSeperti dengan redux-saga dan redux-promise. Kembali lagi ke topik bahasan utama. <span style=\"color:red\">Jadi react redux menurut versi gue, merupakan \nmiddleware redux yang dipake ketika case action nya bersifat async. Contohnya ketika request melalui protokol HTTP/HTTPS REST API. \nSifat pure dari Redux sendiri tidak tahu bagaimana menyikapi perintah yang bersifat asyncronous.</span>\nKarena sebelumnya pake Redux di React belum pake case async maka ini merupakan hal yang baru secara pribadi.</p>\n<p>\nSumber yang di baca dan video prakteknya yang ngejelasin nya baik buat newbie seperti gue:\n<ol>\n    <li>\n        <a href=\"https://medium.com/fullstack-academy/thunks-in-redux-the-basics-85e538a3fe60\">https://medium.com/fullstack-academy/thunks-in-redux-the-basics-85e538a3fe60</a>\n    </li>\n    <li>\n        <a href=\"https://www.youtube.com/watch?v=93p3LxR9xfM\">https://www.youtube.com/watch?v=93p3LxR9xfM</a>\n    </li>\n</ol>\n</p>","frontmatter":{"title":"Bongkar Template React🤔"}}},"pageContext":{"slug":"/bongkar-template-redux/"}}