{"data":{"site":{"siteMetadata":{"title":"positiveneutron.github.io"}},"markdownRemark":{"html":"<p>Kembali di artikel yg ceritain aktivitas gue. Mo on maap baru muncul\nlagi*inconsistency intention dlm menulis telah menyerang kembali.😂</p>\n<p>\nSetelah beberapa bulang ga update. Rasanya banyak sekali yang ingin diceritain. Yo wes biar tetep keliatan concise tanpa mengurangi esensinya, maka diringkas saja dlm 1 artikel ini. Ya ga jauh2 dari peran sebagai front end engineer yg gunain ReactJS buat ngerjain UI/UX even bagian consume logic yang udah dibuat temen2 backend buat. So langsung aja, berikut yang ingin gue share:\n</p>\n<h1>1. Mood Booster untuk coding</h1>\n<p>\nKalau udah ngoding ga lepas dgn yang namanya text editor atau IDE. Dalam 3 bulan ini gue udah gunta ganti 3 tools yaitu 1 IDE dan 2 text editor. Alesan nya pengen dapetin kenyamanan lebih aja dalam menulis baris kode. Ga dipungkirin mood dalam menulis kode dipengaruhi hal ini. Dan pilihan terakhir/ current tool yang gue pilih yaitu Visual Studio Code. Tentunya ga sebatas text editor aja, tapi ada beberapa customisasi kaya indentasi, jenis font, warna tema, sama beberapa plugin. Kepo sama settingan nya. Share <a href=\"https://gist.github.com/positiveneutron/3690cef034022b0abdf7c667eeb0d1e8\" target=\"_blank\">disini</a> ya. \n</p>\n<h1>2. Pake boilerplate buatan orang lain silahkan, ketergantungan JANGAN</h1>\n<p>\nBagian ini merupakan bentuk kritis terhadap habit buat diri sendiri tepatnya. Ketika kita ingin membuat produk/ project dengan diawali dengan starter kit yang dibuat oleh orang lain, maka ada positip negatip nya nya. yakan? sederhananya menurut versi gue, positipnya bisa lbh rapid ngerjain dan negatifnya kita lebih lama memperlajari bahkan cenderung ga tau di beberapa bagian cara kerjanya boilerplate tersebut, terlebih krn kita dikejer deadline.\nAction yg gue ambil dan sepakati sama tim front end yaitu membuat suatu boilerplate versi sendiri. tapi perlu diinget hal ini dilakuin diluar waktu development. Secara teknisnya syarat boilerplate yang diabuat yaitu maintable web component, well arranged pattern, dan cleaner code.(no unused variable atau library contained). Kalau package2 yang digunakan selain react core, yaitu \n</p>","frontmatter":{"title":"Dalam 3 bulan🗓"}}},"pageContext":{"slug":"/dalam-3-bulan/"}}